RubyOnRailsGroupProject/students/app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

  if @student.save
---
INSERT INTO `students` (`studentid`, `fname`, `lname`, `status`, `comments`, `created_at`, `updated_at`) VALUES ('0293490', 'Sean', 'Ryall', 'Yes', 'No commets', '2016-05-02 15:01:43', '2016-05-02 15:01:43')

    def update
      @student = Student.find(params[:id])

      if @student.update(student_params)
---
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
UPDATE `students` SET `status` = 'Currently pending', `updated_at` = '2016-05-02 15:13:26' WHERE `students`.`id` = 1

    def destroy
     @student = Student.find(params[:id])
     @student.destroy
---
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 4 LIMIT 1
DELETE FROM `students` WHERE `students`.`id` = 4