RubyOnRailsGroupProject/students/app/controllers/terms_controller.rb

SELECT `terms`.* FROM `terms`
---
	def index
    	@terms = Term.all

SELECT  `terms`.* FROM `terms` WHERE `terms`.`id` = 1 LIMIT 1
---
	def show
	    @term = Term.find(params[:id])

INSERT INTO `terms` (`name`, `year`, `created_at`, `updated_at`) VALUES ('Fall', '2016', '2016-05-16 12:39:36', '2016-05-16 12:39:36')
---
	def create
		@term = Term.new(term_params)

  		if @term.save